itests/standalone/basic/src/test/resources/soap/envelope-1.2-marshal.xml

<ns2:Envelope xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns3="http://org/wildfly/test/jaxb/model/Customer"><ns2:Body><ns3:Customer><ns3:firstName>John</ns3:firstName><ns3:lastName>Doe</ns3:lastName></ns3:Customer></ns2:Body></ns2:Envelope>